In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
import math

import env

# Exercise 1

Attendance Data

Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

You should end up with something like this:

    name
    Billy    0.5250
    Jane     0.6875
    John     0.9125
    Sally    0.7625
    Name: grade, dtype: float64

In [2]:
# pull attendance table 

url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/tidy_data'
query = '''
SELECT *
FROM attendance
'''
attendance = pd.read_sql(query, url)
attendance.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

# Exercise 2


Coffee Levels

    Read the coffee_levels table.
    
    Transform the data so that each carafe is in it's own column.
    
    Is this the best shape for the data?

In [3]:
query = '''
SELECT *
FROM coffee_levels
'''
coffee_df = pd.read_sql(query, url)
coffee_df.head()

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

# Exercise 3


Cake Recipes

    Read the cake_recipes table. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.
    
    Tidy the data as necessary.
    
    Which recipe, on average, is the best? recipe b
    
    Which oven temperature, on average, produces the best results? 275
    Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

# B-B-Bonus!!!